In [1]:
import numpy as np
import pandas as pd
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df=pd.DataFrame(dict)
print("---------------------------------------------------------")
print(df)
print("---------------------------------------------------------")

---------------------------------------------------------
   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0
---------------------------------------------------------

In [3]:
df.dropna() #by deafult axis is 0

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [5]:
print(df)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [7]:
df.dropna(inplace=True)

In [9]:
print(df)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [11]:
import numpy as np
import pandas as pd
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df=pd.DataFrame(dict)
print("---------------------------------------------------------")
print(df)
print("---------------------------------------------------------")

---------------------------------------------------------
   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0
---------------------------------------------------------

In [13]:
df.dropna(axis=0)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [15]:
print(df)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [19]:
df.dropna(axis=0,inplace=True)
print(df)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [21]:
import numpy as np
import pandas as pd
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df=pd.DataFrame(dict)
print("---------------------------------------------------------")
print(df)
print("---------------------------------------------------------")

---------------------------------------------------------
   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0
---------------------------------------------------------

In [23]:
df.dropna(axis=1,inplace=True)
print(df)

   Third Score
0           52
1           40
2           80
3           98

In [25]:
import numpy as np
import pandas as pd
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df=pd.DataFrame(dict)
print("---------------------------------------------------------")
print(df)
print("---------------------------------------------------------")

---------------------------------------------------------
   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0
---------------------------------------------------------

In [27]:
df.dropna(how="any") # default Value of 'how' argument is 'any' and default axis is 0 (row)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [29]:
print(df)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [31]:
import numpy as np
import pandas as pd
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, np.nan]}
df=pd.DataFrame(dict)
print("---------------------------------------------------------")
print(df)
print("---------------------------------------------------------")

---------------------------------------------------------
   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98           NaN
---------------------------------------------------------

In [35]:
df.dropna(how="all")
# print(df)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98           NaN

In [37]:
df.dropna(axis=1,how="all",inplace=True)

In [39]:
print(df) # will not all values contain NaN

   First Score  Second Score  Third Score
0        100.0          30.0           52
1         90.0           NaN           40
2          NaN          45.0           80
3         95.0          56.0           98